app/controllers/login_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def index
    respond_to do |format|
      if !session[:user_id].blank?
        @user = User.find session[:user_id]

SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
---
  def aa
    respond_to do |format|
      if !session[:user_id].blank?
        @user = User.find session[:user_id]

SELECT `users`.* FROM `users` WHERE `users`.`tel` = 11111111111 ORDER BY `users`.`id` ASC LIMIT 1
SELECT 1 AS one FROM `users` WHERE `users`.`tel` = BINARY 11111111111 LIMIT 1
INSERT INTO `users` (`created_at`, `tel`, `updated_at`) VALUES ('2014-12-16 02:11:15', 11111111111, '2014-12-16 02:11:15')
---
  def create
    if !session[:user_id].blank?
      @user = User.where(tel: params[:user][:tel]).first
      if @user
        redirect_to login_index_path
      else
        redirect_to new_login_path
      end
    elsif !params[:user][:tel].blank?
      @user = User.where(tel: params[:user][:tel]).first
      if @user
        session[:user_id]= @user.id
        redirect_to login_index_path
      else
        @user = User.new(tel: params[:user][:tel])
        if @user.save